Autodesk.Revit.DB.ExtensibleStorage.DataStorage.Create(Autodesk.Revit.DB.Document)
Creates a new DataStorage element and adds it to the document.
doc:
Document to which the new element should be added.
Returns:
The newly created DataStorage element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ExtensibleStorage.DataStorage
An element which allows an API applications to organize and store data.
Remarks:
Applications can create instances of these elements to logically organize
different sets of ExtensibleStorage entities into separate elements.
This allows an application to update one set of data in a local
workshared project without locking other elements.
Since:
2013